matyaskollert/ESA-SAVOIR-Secure-Boot/STM32CubeIDE/NucleoF439-Benchmark/wolfSSL/wolfSSL.I-CUBE-wolfSSL_conf.h
    /* Use this to measure / print heap usage */
    #if 0
        #define USE_WOLFSSL_MEMORY
        #define WOLFSSL_TRACK_MEMORY
        #define WOLFSSL_DEBUG_MEMORY
        #define WOLFSSL_DEBUG_MEMORY_PRINT
    #endif
#else
    //#define NO_WOLFSSL_MEMORY
    //#define NO_ERROR_STRINGS
#endif

/* ------------------------------------------------------------------------- */
/* Port */
/* ------------------------------------------------------------------------- */

/* Override Current Time */
/* Allows custom "custom_time()" function to be used for benchmark */
#define WOLFSSL_USER_CURRTIME

/* ------------------------------------------------------------------------- */
/* RNG */
/* ------------------------------------------------------------------------- */
#define NO_OLD_RNGNAME /* conflicts with STM RNG macro */
#if !defined(WOLF_CONF_RNG) || WOLF_CONF_RNG == 1
    /* default is enabled */
    #define HAVE_HASHDRBG
#else /* WOLF_CONF_RNG == 0 */
    #define WC_NO_HASHDRBG
    #define WC_NO_RNG
#endif

/* ------------------------------------------------------------------------- */
/* Disable Features */
/* ------------------------------------------------------------------------- */
#if defined(WOLF_CONF_TLS12) && WOLF_CONF_TLS12 == 0
    #define WOLFSSL_NO_TLS12
#endif
#if defined(WOLF_CONF_WOLFCRYPT_ONLY) && WOLF_CONF_WOLFCRYPT_ONLY == 1
    #define WOLFCRYPT_ONLY
#endif
//#define NO_WOLFSSL_SERVER
//#define NO_WOLFSSL_CLIENT

#if defined(WOLF_CONF_TEST) && WOLF_CONF_TEST == 0
    #define NO_CRYPT_TEST
    #define NO_CRYPT_BENCHMARK
#endif

#define NO_FILESYSTEM
#define NO_WRITEV
#define NO_MAIN_DRIVER
#define NO_DEV_RANDOM
#define NO_OLD_TLS
#define WOLFSSL_NO_CLIENT_AUTH /* disable client auth for Ed25519/Ed448 */

#define NO_DSA
#define NO_RC4
#define NO_MD4
#define NO_DES3

#ifndef WOLFSSL_SHAKE128
#define WOLFSSL_NO_SHAKE128
#endif

#ifndef WOLFSSL_SHAKE256
#define WOLFSSL_NO_SHAKE256
#endif

/* In-lining of misc.c functions */
/* If defined, must include wolfcrypt/src/misc.c in build */
/* Slower, but about 1k smaller */
//#define NO_INLINE

/* Base16 / Base64 encoding */
//#define NO_CODING

/* bypass certificate date checking, due to lack of properly configured RTC source */
#ifndef HAL_RTC_MODULE_ENABLED
    #define NO_ASN_TIME
#endif

/* =========================================================================
 * Benchmark algorithm selection — mirrors benchmark.h ALGO_* constants.
 * BENCHMARK_ALGO is passed as a -D compiler flag or defined in benchmark.h.
 * Each section enables the wolfSSL primitives required by that algorithm.
 * ========================================================================= */

/* Mirror ALGO_* values so numeric -D flags can be compared below.
 * These MUST stay in sync with Core/Inc/benchmark.h.                        */
#ifndef ALGO_ECDSA
#define ALGO_ECDSA      1
#define ALGO_RSA        2
#define ALGO_ML_DSA_44  3
#define ALGO_ML_DSA_65  4
#define ALGO_LMS        5
#endif



/* ------------------------------------------------------------------------- */
/* ML-DSA / Dilithium  (ALGO_ML_DSA_44 = 3, ALGO_ML_DSA_65 = 4,             */
/*                       ALGO_ML_DSA_87 = 5)                                 */
/* Requires: HAVE_DILITHIUM, SHA-3, SHAKE-128/256.                           */
/* Signing code is excluded to save flash — verify-only build.               */
/* ------------------------------------------------------------------------- */

/* SHA-3 / SHAKE primitives required internally by Dilithium */
#undef  WOLFSSL_SHA3
#define WOLFSSL_SHA3

#undef  WOLFSSL_NO_SHAKE128
#undef  WOLFSSL_SHAKE128
#define WOLFSSL_SHAKE128

#undef  WOLFSSL_NO_SHAKE256
#undef  WOLFSSL_SHAKE256
#define WOLFSSL_SHAKE256

/* wolfCrypt Dilithium / ML-DSA implementation */
#define HAVE_DILITHIUM
#define WOLFSSL_WC_DILITHIUM

/* Public-key import + verification only */
#define WOLFSSL_DILITHIUM_PUBLIC_KEY
#define WOLFSSL_DILITHIUM_NO_SIGN
#define WOLFSSL_DILITHIUM_NO_MAKE_KEY

/* ------------------------------------------------------------------------- */
/* LMS  (ALGO_LMS = 7)                                                       */
/* Parameter set: LMS-SHA256-M32-H5 / LMOTS-N32-W8 (sig ≈ 1292 B).         */
/* Requires: WOLFSSL_HAVE_LMS, SHA-256 (already enabled).                   */
/* ------------------------------------------------------------------------- */

#undef  WOLFSSL_EXPERIMENTAL_SETTINGS
#define WOLFSSL_EXPERIMENTAL_SETTINGS

#define WOLFSSL_HAVE_LMS
#define WOLFSSL_LMS_VERIFY_ONLY
#define WOLFSSL_WC_LMS

#ifdef __cplusplus
}
#endif
#endif /* WOLFSSL_I_CUBE_WOLFSSL_CONF_H_H */

/**
  * @}
  */

/*****END OF FILE****/
